The roof couldn't be cut.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCutRoofError { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCutRoofError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCutRoofError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CutFailures Class
  Autodesk.Revit.DB Namespace